// - Дано натуральное число n. Выведите все числа от 1 до n.

// function numn  (i, n)
// { i ++;
// if (i>n){
//     return
// }
//     console.log(i)
//     numn(i,n);
// }
// numn(0, 10)
// - Даны два целых числа A и В . Выведите все числа от A до B включительно, в порядке возрастания, если A < B, или в порядке убывания в противном случае.
//
// function AB (a, b)
// { if (a<b)
// {a ++;
//     if (a >b){
//         return
//     }
//     console.log(a)
// }
// else if (a>b){
//     a--;
//     if (a<b){
//         return;
//     }
//     console.log(a)
// }
// AB(a,b);
// }
// AB(7, 2)
//
// -   функція Приймає масив та число "i", та міняє місцями об`єкт який знаходиться в індексі "i" на "i+1"
//   EXAMPLE:
//   foo([9,8,0,4], 0) // ==> [ 8, 9, 0, 4 ]
function foo (arr,i){
    for (let j = 1; j =i+1 ; j++) {
        j=j+1;
     return arr;
    }

}
foo([9,8,0,4],1)

//   foo([9,8,0,4], 1) // ==> [ 9 ,0, 8, 4 ]
//   foo([9,8,0,4], 2) // ==> [ 9, 8, 4, 0 ]
//

// - Сворити функцію яка буде переносити елементи з значенням 0 у кінець маисву. Зберігаючи при цьому порядок не нульових значень.
// Двожина масиву від 2 до 100
// EXAMPLE:
// [1,0,6,0,3] => [1,6,3,0,0]
// [0,1,2,3,4] => [1,2,3,4,0]
// [0,0,1,0]   => [1,0,0,0]